export type Action =

  /** Добавить */
  | 'add'

  /** Применить */
  | 'apply'

  /** Заблокировать */
  | 'block'

  /** Очистить */
  | 'clear'

  /** Отмена */
  | 'cancel'

  /** Закрыть */
  | 'close'

  /** Показать */
  | 'show'

  /** Скрыть */
  | 'hide'

  /** Скачать */
  | 'download'

  /** Загрузить */
  | 'upload'

  /** Комментировать */
  | 'comment'

  /** Настроить */
  | 'configure'

  /** Копировать */
  | 'copy'

  /** Сохранить */
  | 'save'

  /** Удалить */
  | 'delete'

  /** Перетащить */
  | 'drag'

  /** Выполнить/Завершить */
  | 'done'

  /** Войти */
  | 'enter'

  /** Редактировать */
  | 'edit'

  /** Выйти */
  | 'exit'

  /** Добавить в избранное */
  | 'favorite'

  /** Выключить звук */
  | 'mute'

  /** Включить звук */
  | 'unmute'

  /** Указать/получить местоположение */
  | 'locate'

  /** Назад */
  | 'goBack'

  /** Нравится */
  | 'like'

  /** Не нравится */
  | 'dislike'

  /** Заблокировать (замкнуть) */
  | 'lock'

  /** Разблокировать (разомкнуть) */
  | 'unlock'

  /** Переместить */
  | 'move'

  /** Применить/Одобрить/Ok */
  | 'ok'

  /** Вставить из буфера */
  | 'paste'

  /** Закрепить */
  | 'pin'

  /** Заблокировать/Отключить (забанить) */
  | 'ban'

  /** Отклонить */
  | 'accept'

  /** Отклонить */
  | 'reject'

  /** Восстановить */
  | 'restore'

  /** Вернуть/Восстановить */
  | 'return'

  /** Вернуть/Восстановить */
  | 'undo'

  /** Повторить */
  | 'redo'

  /** Обновить */
  | 'refresh'
  | 'reload'

  /** Искать */
  | 'search'

  /** Фильтровать/Отсеять */
  | 'filter'

  /** Запланировать */
  | 'schedule'

  /** Сортировать */
  | 'sort'

  /** Настроить */
  | 'tune'

  /** Анализировать */
  | 'analyze'

  /** Распечатать */
  | 'print'

  /** Цитировать */
  | 'quote'

  /** Сфотографировать */
  | 'photo'

  /** Прикрепить картинку */
  | 'picture'

  /** Отправить */
  | 'send'

  /** Записать */
  | 'record'

  /** Включить микрофон */
  | 'micOn'

  /** Выключить микрофон */
  | 'micOff'

  /** Воспроизвести */
  | 'play'

  /** Приостановить/Пауза */
  | 'pause'

  /** Остановить */
  | 'stop'

  /** Написать */
  | 'message'
  | 'text'

  /** Позвонить */
  | 'call'
  ;
